Maxima 5.37.2 http://maxima.sourceforge.net
using Lisp SBCL 1.3.11
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
maxima_userdir:  /Users/rds/.maxima 
(%i1) batch("UniNullstellensatz.mac")

read and interpret file: /Users/rds/Documents/Groebner/UniNullstellensatz.mac
(%i2) kill(f,x,fp,gcdffp)
(%o2)                                done
(%i3) f:x^11-x^10+2*x^8-4*x^7+3*x^5-3*x^4+x^3+3*x^2-x-1
            11    10      8      7      5      4    3      2
(%o3)      x   - x   + 2 x  - 4 x  + 3 x  - 3 x  + x  + 3 x  - x - 1
(%i4) fp:diff(f,x,1)
            10       9       7       6       4       3      2
(%o4)   11 x   - 10 x  + 16 x  - 28 x  + 15 x  - 12 x  + 3 x  + 6 x - 1
(%i5) gcdffp:gcd(f,fp)
                             6    5    3      2
(%o5)                       x  - x  + x  - 2 x  + 1
(%i6) f/gcdffp
                        2    3      4      5      7      8    10    11
         (- 1) - x + 3 x  + x  - 3 x  + 3 x  - 4 x  + 2 x  - x   + x
(%o6)    -------------------------------------------------------------
                             6    5    3      2
                            x  - x  + x  - 2 x  + 1
(%i7) factor(%)
                                           3
(%o7)                    (x - 1) (x + 1) (x  + x + 1)
(%i8) factor(f)
                               3        2           3 2
(%o8)                   (x - 1)  (1 + x)  (1 + x + x )
(%o8)        /Users/rds/Documents/Groebner/UniNullstellensatz.mac
